Revit 2026 API

# OptionsView Property

---

The view used for geometry extraction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View View { get; set; }
```
```vb
Public Property View As View
	Get
	Set
```
```cpp
public:
property View^ View {
	View^ get ();
	void set (View^ value);
}
```
```fsharp
member View : View with get, set
```

#### Property Value

View

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when setting this property with a . |
| InvalidOperationException | Thrown when setting this property, if DetailLevel is already set. When DetailLevel is set view-specific geometry can't be extracted. |

If a view-specific version of an element exists, it will be extracted in the retrieval of geometry. Also, the detail level of the geometry will be taken from the view's detail level.

#### Reference

Options Class

Autodesk.Revit.DB Namespace